Repository: FPGAwars/iceK
Catalog: locale/*/*.po
Languages: es_es

source: Constant bit 0
es_es: Bit 0 constante

source: Constant bit 1
es_es: Bit 1 constante

source: generic
es_es: generico

source: 1-bit generic constant (0/1)
es_es: Constante genérica de 1 bit (0/1)

source: Generic: 2-bits generic constant (0,1,2,3)
es_es: Constante genérica de 2 bits (0, 1, 2, 3)

source: Generic: 2-bits k-1 constant (Input values: 1,2,3,4). It returns the value input by the user minus 1. Outputs: 0,1,2,3
es_es: Generico: Constante k-1 de 2 bits (valores de entrada 1,2,3,4). Devuelve el valor de entrada dado por el usuario menos 1. Salidas: 0,1,2,3

source: Output: 0,1,2,3
es_es: Salida: 0,1,2,3

source: Inputs: 1,2,3,4
es_es: Entradas: 1,2,3,4

source: value-0
es_es: valor-0

source: 2bits constant value: 0
es_es: Valor constante 0 de 2 bits

source: value-1
es_es: valor-1

source: 2bits constant value: 1
es_es: Valor constante 1 de 2 bits

source: value-2
es_es: valor-2

source: 2bits constant value: 2
es_es: Valor constante 2 de 2 bits

source: value-3
es_es: valor-3

source: 2bits constant value: 3
es_es: Valor constante 3 de 2 bits

source: Generic: 3-bits generic constant (0-7)
es_es: Constante genérica de 3 bits (0-7)

source: Generic: 3-bits k-1 constant (Input values: 1,2,...,8). It returns the value input by the user minus 1. Outputs: 0,1,2,...,7
es_es: Generico: Constante k-1 de 3 bits (valores de entrada 1,2,...,8). Devuelve el valor de entrada dado por el usuario menos 1. Salidas: 0,1,2,...,7

source: Output: 0,1,2,...,7
es_es: Salida: 0,1,2,...,7

source: Inputs: 1,2,...,8
es_es: Entradas: 1,2,...,8

source: 3bits constant value: 0
es_es: Valor constante 0 de 3 bits

source: 3bits constant value: 1
es_es: Valor constante 1 de 3 bits

source: 3bits constant value: 2
es_es: Valor constante 2 de 3 bits

source: value-4
es_es: valor-4

source: 3bits constant value: 4
es_es: Valor constante 4 de 3 bits

source: value-7
es_es: valor-7

source: 3bits constant value: 7
es_es: Valor constante 7 de 3 bits

source: Generic: 4-bits generic constant (0-15)
es_es: Constante genérica de 4 bits (0-15)

source: Generic: 4-bits k-1 constant (Input values: 1,2,...,16). It returns the value input by the user minus 1. Outputs: 0,1,2,...,15
es_es: Generico: Constante k-1 de 4 bits (valores de entrada 1,2,...,16). Devuelve el valor de entrada dado por el usuario menos 1. Salidas: 0,1,2,...,15

source: Output: 0,1,2,...,15
es_es: Salida: 0,1,2,...,15

source: Inputs: 1,2,...,16
es_es: Entradas: 1,2,...,16

source: 4bits constant value: 0
es_es: Valor constante 0 de 4 bits

source: value-0xF
es_es: valor-0xF

source: 4bits constant value: 15 (0xF in hexadecimal)
es_es: Valor constante de 4 bits: 15 (0xF en hexadecimal)

source: 4bits constant value: 1
es_es: Valor constante 1 de 4 bits

source: 4bits constant value: 2
es_es: Valor constante 2 de 4 bits

source: 4bits constant value: 4
es_es: Valor constante 4 de 4 bits

source: value-8
es_es: valor-8

source: 4bits constant value: 8
es_es: Valor constante 8 de 4 bits

source: Generic: 5-bits generic constant (0-31)
es_es: Constante genérica de 5 bits (0-31)

source: Generic: 5-bits k-1 constant (Input values: 1,2,...,32). It returns the value input by the user minus 1. Outputs: 0,1,2,...,31
es_es: Generico: Constante k-1 de 5 bits (valores de entrada 1,2,...,32). Devuelve el valor de entrada dado por el usuario menos 1. Salidas: 0,1,2,...,31

source: Output: 0,1,2,...,31
es_es: Salida: 0,1,2,...,31

source: Inputs: 1,2,...,32
es_es: Entradas: 1,2,...,32

source: 5bits constant value: 0
es_es: Valor constante 0 de 5 bits

source: Generic: 6-bits generic constant (0-63)
es_es: Constante genérica de 6 bits (0-63)

source: Generic: 6-bits k-1 constant (Input values: 1,2,...,64). It returns the value input by the user minus 1. Outputs: 0,1,2,...,63
es_es: Generico: Constante k-1 de 6 bits (valores de entrada 1,2,...,64). Devuelve el valor de entrada dado por el usuario menos 1. Salidas: 0,1,2,...,63

source: Output: 0,1,2,...,63
es_es: Salida: 0,1,2,...,63

source: Inputs: 1,2,...,64
es_es: Entradas: 1,2,...,64

source: 6bits constant value: 0
es_es: Valor constante 0 de 6 bits

source: Generic: 7-bits generic constant (0-127)
es_es: Constante genérica de 7 bits (0-127)

source: Generic: 7-bits k-1 constant (Input values: 1,2,...,128). It returns the value input by the user minus 1. Outputs: 0,1,2,...,127
es_es: Generico: Constante k-1 de 7 bits (valores de entrada 1,2,...,128). Devuelve el valor de entrada dado por el usuario menos 1. Salidas: 0,1,2,...,127

source: Output: 0,1,2,...,127
es_es: Salida: 0,1,2,...,127

source: Inputs: 1,2,...,128
es_es: Entradas: 1,2,...,128

source: 7bits constant value: 0
es_es: Valor constante 0 de 7 bits

source: 8bits ASCII Letter A
es_es: Letra ASCII de 8 bits

source: Generic: 8-bits generic constant (0-255)
es_es: Constante genérica de 8 bits (0-255)

source: Ascii-Asterisk
es_es: Ascii-Asterisco

source: 8bits ASCII asterisk symbol *
es_es: Símbolo ASCII asterisco * de 8 bits

source: Generic: 8-bits k-1 constant (Input values: 1,2,...,256). It returns the value input by the user minus 1. Outputs: 0,1,2,...,255
es_es: Generico: Constante k-1 de 8 bits (valores de entrada 1,2,...,256). Devuelve el valor de entrada dado por el usuario menos 1. Salidas: 0,1,2,...,255

source: Output: 0,1,2,...,255
es_es: Salida: 0,1,2,...,255

source: Inputs: 1,2,...,256
es_es: Entradas: 1,2,...,256

source: 8bits constant value: 0
es_es: Valor constante 0 de 8 bits

source: Generic: 9-bits generic constant
es_es: Constante genérica de 9 bits

source: 9bits constant value: 0
es_es: Valor constante 0 de 9 bits

source: 10bits constant value: 0
es_es: Valor constante 0 de 10 bits

source: Generic: 11-bits generic constant
es_es: Constante genérica de 11 bits

source: 11bits constant value: 0
es_es: Valor constante 0 de 11 bits

source: Generic: 12-bits generic constant (0-4095)
es_es: Constante genérica de 12 bits (0-4095)

source: Generic: 12-bits k-1 constant (Input values: 1,2,...,4096). It returns the value input by the user minus 1. Outputs: 0,1,2,...,4095
es_es: Generico: Constante k-1 de 12 bits (valores de entrada 1,2,...,4096). Devuelve el valor de entrada dado por el usuario menos 1. Salidas: 0,1,2,...,4095

source: Output: 0,1,2,...,4095
es_es: Salida: 0,1,2,...,4095

source: Inputs: 1,2,...,4096
es_es: Entradas: 1,2,...,4096

source: 12bits constant value: 0
es_es: Valor constante 0 de 12 bits

source: Generic: 15-bits generic constant
es_es: Constante genérica de 15 bits

source: 15bits constant value: 0
es_es: Valor constante 0 de 15 bits

source: Generic: 16-bits k-1 constant (Input values: 1,2,...,h10000). It returns the value input by the user minus 1. Outputs: 0,1,2,...,FFFF
es_es: Generico: Constante k-1 de 16 bits (valores de entrada 1,2,...,h10000). Devuelve el valor de entrada dado por el usuario menos 1. Salidas: 0,1,2,...,FFFF

source: Output: 0,1,2,...,hffff
es_es: Salida: 0,1,2,...,hffff

source: Inputs: 1,2,...,h10000
es_es: Entradas: 1,2,...,h10000

source: Generic: 16-bits generic constant
es_es: Constante genérica de 16 bits

source: 16bits constant value: 0
es_es: Valor constante 0 de 16 bits

source: Generic: 17-bits generic constant
es_es: Constante genérica de 17 bits

source: Generic: 19-bits generic constant
es_es: Constante genérica de 19 bits

source: 19bits constant value: 0
es_es: Valor constante 0 de 19 bits

source: Generic: 20-bits k-1 constant (Input values: 1,2,...,h100000). It returns the value input by the user minus 1. Outputs: 0,1,2,...,FFFFF
es_es: Generico: Constante k-1 de 20 bits (valores de entrada 1,2,...,h100000). Devuelve el valor de entrada dado por el usuario menos 1. Salidas: 0,1,2,...,FFFFF

source: Output: 0,1,2,...,hfffff
es_es: Salida: 0,1,2,...,hfffff

source: Inputs: 1,2,...,h100000
es_es: Entradas: 1,2,...,h100000

source: Generic: 20-bits generic constant
es_es: Constante genérica de 20 bits

source: 20bits constant value: 0
es_es: Valor constante 0 de 20 bits

source: Generic: 22-bits generic constant
es_es: Constante genérica de 22 bits

source: Generic: 23-bits generic constant
es_es: Constante genérica de 23 bits

source: 23bits constant value: 0
es_es: Valor constante 0 de 23 bits

source: Generic: 24-bits k-1 constant (Input values: 1,2,...,h1000000). It returns the value input by the user minus 1. Outputs: 0,1,2,...,FFFFFF
es_es: Generico: Constante k-1 de 24 bits (valores de entrada 1,2,...,h1000000). Devuelve el valor de entrada dado por el usuario menos 1. Salidas:0,1,2,...,FFFFFF

source: Output: 0,1,2,...,hffffff
es_es: Salida:0,1,2,...,hffffff

source: Inputs: 1,2,...,h1000000
es_es: Entradas: 1,2,...,h1000000

source: Generic: 24-bits generic constant
es_es: Constante genérica de 24 bits

source: 24bits constant value: 0
es_es: Valor constante 0 de 24 bits

source: Generic: 27-bits generic constant
es_es: Constante genérica de 27 bits

source: 27bits constant value: 0
es_es: Valor constante 0 de 27 bits

source: Generic: 28-bits k-1 constant (Input values: 1,2,...,h10000000). It returns the value input by the user minus 1. Outputs: 0,1,2,...,FFFFFFF
es_es: Generico: Constante k-1 de 28 bits (valores de entrada 1,2,...,h10000000). Devuelve el valor de entrada dado por el usuario menos 1. Salidas: 0,1,2,...,FFFFFFF

source: Generic: 28-bits generic constant
es_es: Constante genérica de 28 bits

source: 28bits constant value: 0
es_es: Valor constante 0 de 28 bits

source: Generic: 29-bits generic constant
es_es: Constante genérica de 29 bits

source: Generic: 31-bits generic constant
es_es: Constante genérica de 31 bits

source: 31bits constant value: 0
es_es: Valor constante 0 de 31 bits

source: Generic: 32-bits k-1 constant (Input values: 1,2,...,h100000000). It returns the value input by the user minus 1. Outputs: 0,1,2,...,FFFFFFFF
es_es: Generico: Constante k-1 de 32 bits (valores de entrada 1,2,...,h100000000). Devuelve el valor de entrada dado por el usuario menos 1. Salidas: 0,1,2,...,FFFFFFFF

source: Generic: 32-bits generic constant
es_es: Constante genérica de 32bits

source: 32bits constant value: 0
es_es: Valor constante 0 de 32 bits

source: TESTs
es_es: PRUEBAs

source: 00-Index
es_es: 00-Indice

source: # INDEX: IceK Collection
es_es: # ÍNDICE: Colección iceK

source: ### 1-bit constants
es_es: ### Constantes de 1 bit

source: Generic constant
es_es: Constante genérica

source: ### 2-bits constants
es_es: ### Constantes de 2 bits

source: ### 3-bits constants
es_es: ### Constantes de 3 bits

source: ### 4-bits constants
es_es: ### Constantes de 8 bits

source: ### 5-bits constants
es_es: ### Constantes de 5 bits

source: ### 6-bits constants
es_es: ### Constantes de 6 bits

source: ### 7-bits constants
es_es: ### Constantes de 7 bits

source: ### 8-bits constants
es_es: ### Constantes de 8 bits

source: ### 12-bits constants
es_es: ### Constantes de 12 bits

source: ### 16-bits constants
es_es: ### Constantes de 16 bits

source: ### 20-bits constants
es_es: ### Constantes de 20 bits

source: ### 24-bits constants
es_es: ### Constantes de 24 bits

source: ### 28-bits constants
es_es: ### Constantes de 28 bits

source: ### 32-bits constants
es_es: ### Constantes de 32 bits

source: ### 11-bits constants
es_es: ### Constantes de 11 bits

source: ### 9-bits constants
es_es: ### Constantes de 9 bits

source: ### 10-bits constants
es_es: ### Constantes de 10 bits

source: ### 15-bits constants
es_es: ### Constantes de 15 bits

source: ### 19-bits constants
es_es: ### Constantes de 19 bits

source: ### 23-bits constants
es_es: ### Constantes de 23 bits

source: ### 27-bits constants
es_es: ### Constantes de 27 bits

source: ### 31-bits constants
es_es: ### Constantes de 31 bits

source: ### 22-bits constants
es_es: ### Constantes de 21 bits

source: ### 17-bits constants
es_es: ### Constantes de 17 bits

source: ### 29-bits constants
es_es: ### Constantes de 29 bits

source: # Turn on a LED
es_es: # Encender un LED

source: 1-bit constant
es_es: Constante de 1 bit

source: Output pin
es_es: Pin de salida

source: ## Result The LED0 is on (If you are connected to Internet you will see a picture) ![Alhambra II image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/Alhambra-II/Example-01-01.png)
es_es: ## Resultado: Se enciende el LED0 (Si tienes conexión a internet verás una imagen) ![Alhambra II image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/Alhambra-II/Example-01-01.png)

source: # Turning on two LEDs The 2-bit constant 3 (11 in binary) is used to turn on two LEDs
es_es: # Encendiendo dos LEDs La constante 3 de 2 bits (11 en binario) se usa para encender dos LEDs

source: Output pins
es_es: Pines de salida

source: 2-bit constant value 3 (11 in binary)
es_es: Valor constante 3 de 2 bits (11 en binario)

source: ## Result: The LEDs 0 and 1 are turned on (If you are connected to internet you will see a picture) ![Alhambra II board picture](https://raw.githubusercontent.com/FPGAwars/iceK/main/wiki/images/Alhambra-II/Example-01-02-2.png)
es_es: ## Resultado: Se encienden los LEDs 0 y 1 (Si tienes conexión a internet verás una imagen) ![Alhambra II board picture](https://raw.githubusercontent.com/FPGAwars/iceK/main/wiki/images/Alhambra-II/Example-01-02-2.png)

source: ## Result The RGB LED is turned GREEN (If you are connected to Internet you will see a picture) ![Fomu image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/Fomu/Example-01-02-2.png)
es_es: ## Resultado: El LED RGB se pone en verde (Si tienes conexión a internet verás una imagen) ![Fomu image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/Fomu/Example-01-02-2.png)

source: usb pins must be "0"
es_es: los pines USB deben estar a "0"

source: Green
es_es: Verde

source: Red
es_es: Rojo

source: Blue
es_es: Azul

source: RGB LED work with negative logic: * 0: Turn LED on * 1: Turn LED off The three components (red, green, blue) act as independent LEDs
es_es: El LED RGB funcion con lógica negativa: * 0: Encender el LED * 1: Apagar el LED Las tres componentes (rojo, verde, azul) funcionan como LEDs independientes

source: The Red and Blue components are turned off
es_es: Las componentes roja y azul se apagan

source: # Turn on two LEDs
es_es: # Encender dos LEDs

source: ## Result The components Green and Red of the RGB LED are turned on, so that the color displayed is Yellow (If you are connected to Internet you will see a picture) ![Fomu image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/Fomu/Example-01-02-2.png)
es_es: ## Resultado: Las componentes Verde y Roja del LED RGB se enciende, de forma que se muestra el color Amarillo (Si tienes conexión a internet verás una imagen) ![Fomu image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/Fomu/Example-01-02-2.png)

source: 2-bit constant value 0 (00 in binary)
es_es: Valor constante 0 de 2 bits (00 en binario)

source: LEDs R and G work with negative logic: * 0: Turn LED on * 1: Turn LED off
es_es: Los LEDs R y G funcionan con lógica negativa: * 0: Encender LED * 1: Apagar LED

source: The RGB2 is turned off (No blue color) (negative logic)
es_es: El RGB2 se apaga (sin color azul) (lógica negativa)

source: ## Result The LED0 is on (If you are connected to Internet you will see a picture) ![Icezum Alhambra image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/Icezum-Alhambra/Example-01-01-2.png)
es_es: ## Resultado: Se enciende el LED0 (Si tienes conexión a internet verás una imagen) ![Icezum Alhambra image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/Icezum-Alhambra/Example-01-01-2.png)

source: ## Result: The LEDs 0 and 1 are turned on (If you are connected to internet you will see a picture) ![Icezum Alhambra picture](https://github.com/FPGAwars/iceK/raw/main/wiki/images/Icezum-Alhambra/Example-01-02-2.png)
es_es: ## Resultado: Se encienden los LEDs 0 y 1 (Si tienes conexión a internet verás una imagen) ![Icezum Alhambra picture](https://github.com/FPGAwars/iceK/raw/main/wiki/images/Icezum-Alhambra/Example-01-02-2.png)

source: ## Result The LED1 (blue) is on (If you are connected to Internet you will see a picture) ![MyStorm blackIce image](https://raw.githubusercontent.com/FPGAwars/iceK/main/wiki/images/MyStorm-Blackice/Example-01-01-2.png)
es_es: ## Resultado: Se enciende el LED1 (azul) (Si tienes conexión a internet verás una imagen) ![MyStorm blackIce image](https://raw.githubusercontent.com/FPGAwars/iceK/main/wiki/images/MyStorm-Blackice/Example-01-01-2.png)

source: Turn off LED2 (The FPGA pins are in high impedance state so that not driven LEDs bright a little bit)
es_es: Apagar el LED2 (Los pines de la FPGA están en alta impedancia por lo que los LEDs no usados brillan un poquito)

source: ## Result: The LEDs 1 (blue) and 2 (green) are turned on (If you are connected to internet you will see a picture) ![Mystorm Blackice](https://github.com/FPGAwars/iceK/raw/main/wiki/images/MyStorm-Blackice/Example-01-02-2.png)
es_es: ## Resultado: Se encienden los LEDs 1 (azul) y 2 (verde) (Si tienes conexión a internet verás una imagen) ![Mystorm Blackice](https://github.com/FPGAwars/iceK/raw/main/wiki/images/MyStorm-Blackice/Example-01-02-2.png)

source: ## Result The LED D1 (green) is on (If you are connected to Internet you will see a picture) ![Nandland-Go-board image](https://raw.githubusercontent.com/FPGAwars/iceK/main/wiki/images/NandLand-Go-Board/Example-01-01-2.png)
es_es: ## Resultado: Se enciende el LED D1 (Si tienes conexión a internet verás una imagen) ![Nandland-Go-board image](https://raw.githubusercontent.com/FPGAwars/iceK/main/wiki/images/NandLand-Go-Board/Example-01-01-2.png)

source: ## Result: The LEDs D1 and D2 are turned on (If you are connected to internet you will see a picture) ![Nandland Go Board picture](https://raw.githubusercontent.com/FPGAwars/iceK/main/wiki/images/NandLand-Go-Board/Example-01-02-2.png)
es_es: ## Resultado: Se encienden los LED D1 y D2 (Si tienes conexión a internet verás una imagen) ![Nandland Go Board picture](https://raw.githubusercontent.com/FPGAwars/iceK/main/wiki/images/NandLand-Go-Board/Example-01-02-2.png)

source: ## Result The LED0 (D0) is on (red) (If you are connected to Internet you will see a picture) ![Radiona ULX3S-12F image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/Radiona-ULX3S-12F/Example-01-01-2.png)
es_es: ## Resultado: Se enciende el LED0 (D0) (Si tienes conexión a internet verás una imagen) ![Radiona ULX3S-12F image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/Radiona-ULX3S-12F/Example-01-01-2.png)

source: wifi_gpio0 should be 0 if wifi is not used
es_es: wifi_spio0 debe estar a 0 si no se usa la wiki

source: ## Result: The LEDs 0 (D0,red) and 1 (D1, orange) are turned on (If you are connected to Internet you will see a picture) ![Radiona ULX3S-12F image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/Radiona-ULX3S-12F/Example-01-02-2.png)
es_es: ## Resultado: Se encienden los LEDs 0 (D0, rojo) y 1 (D1, naranja) (Si tienes conexión a internet verás una imagen) ![Radiona ULX3S-12F image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/Radiona-ULX3S-12F/Example-01-02-2.png)

source: ## Result The LED0 (red, D9) is on (If you are connected to Internet you will see a picture) ![Lattice ice40HX8K Breakout Board image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iCE40HX8K-Breakout/Example-01-01-2.png)
es_es: ## Resultado: Se enciende el LED0 (rojo, D9) (Si tienes conexión a internet verás una imagen) ![Lattice ice40HX8K Breakout Board image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iCE40HX8K-Breakout/Example-01-01-2.png)

source: ## Result: The LEDs 0 (D9) and 1 (D8) are turned on (If you are connected to internet you will see a picture) ![Lattice iCE40-HX8K Breakout board Image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iCE40HX8K-Breakout/Example-01-02-2.png)
es_es: ## Resultado: Se encienden los LEDs 0 (D9) y 1 (D8) (Si tienes conexión a internet verás una imagen) ![Lattice iCE40-HX8K Breakout board Image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iCE40HX8K-Breakout/Example-01-02-2.png)

source: ## Result The RGB LED is turned RED (If you are connected to Internet you will see a picture) ![Lattice ice40UP Breakout Board image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iCE40UP-Breakout/Example-01-01-2.png)
es_es: ## Resultado: El LED RGB se pone en rojo (Si tienes conexión a internet verás una imagen) ![Lattice ice40UP Breakout Board image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iCE40UP-Breakout/Example-01-01-2.png)

source: The Green and Blue components are turned off
es_es: Las componentes verde y azul se apagan

source: ## Result The components Red and Green of the RGB LED are turned on, so that the color displayed is Yellow (If you are connected to Internet you will see a picture) ![Lattice ice40UP Breakout Board image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iCE40UP-Breakout/Example-01-02-2.png)
es_es: ## Resultado: Las componentes Roja y Verde del LED RGB se enciende, de forma que se muestra el color Amarillo (Si tienes conexión a internet verás una imagen) ![Lattice ice40UP Breakout Board image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iCE40UP-Breakout/Example-01-02-2.png)

source: The LED_B is turned off (No blue color) (negative logitc)
es_es: El LED_B se apaga (Sin color azul) (lógica negativa)

source: ## Result The RGB LED is turned RED (If you are connected to Internet you will see a picture) ![iCESugar 1.5 image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iCESugar-1.5/Example-01-01-2.png)
es_es: ## Resultado: El LED RGB se pone en rojo (Si tienes conexión a internet verás una imagen) ![iCESugar 1.5 image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iCESugar-1.5/Example-01-01-2.png)

source: ## Result The components Red and Blue of the RGB LED are turned on, so that the color displayed is Magenta (If you are connected to Internet you will see a picture) ![iCESugar 1.5 image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iCESugar-1.5/Example-01-02-2.png)
es_es: ## Resultado: Las componentes Roja y Azul del LED RGB se enciende, de forma que se muestra el color Magenta (Si tienes conexión a internet verás una imagen) ![iCESugar 1.5 image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iCESugar-1.5/Example-01-02-2.png)

source: The LED_G is turned off (No blue color) (negative logitc)
es_es: El LED_G se apaga (Sin color azul) (Lógica negativa)

source: # Turn on the red LED
es_es: # Encender el LED rojo

source: ## Result The green LED (G) is on (If you are connected to Internet you will see a picture) ![icebreakerA image](https://raw.githubusercontent.com/FPGAwars/iceK/main/wiki/images/iceBreaker/Example-01-01-2.png)
es_es: ## Resultado: Se enciende el LED (G) verde (Si tienes conexión a internet verás una imagen) ![icebreakerA image](https://raw.githubusercontent.com/FPGAwars/iceK/main/wiki/images/iceBreaker/Example-01-01-2.png)

source: LEDs G and R works with negative logic: * 0: Turn LED on * 1: Turn LED off
es_es: Los LEDs G y R funcionan con lógica negativa: * 0: Encender LED * 1: Apagar LED

source: # Turning on two LEDs The 2-bit constant 0 (00 in binary) is used to turn on two LEDs
es_es: # Encendiendo dos LEDs La constante 0 de 2 bits (00 en binario) se usa para encender dos LEDs

source: ## Result: The LEDs G and R are turned on (If you are connected to internet you will see a picture) ![iceBreaker board picture](https://raw.githubusercontent.com/FPGAwars/iceK/main/wiki/images/iceBreaker/Example-01-02-2.png)
es_es: ## Resultado: Se encienden los LEDs G y R (Si tienes conexión a internet verás una imagen) ![iceBreaker board picture](https://raw.githubusercontent.com/FPGAwars/iceK/main/wiki/images/iceBreaker/Example-01-02-2.png)
