Repository: FPGAwars/iceK
Catalog: locale/*/*.po
Languages: es_es

source: Initial default value: 0
es_es: Valor por defecto inicial: 0

source: ## Edges detector It generates a 1-period pulse (tic) when an edge (Rising or falling) is detected on the input signal
es_es: ## Detector de flancos Genera un pulso de un ciclo de anchura cuando se detecta un flanco (de subida o bajada) en la señal de entrada

source: The output is 1 if the current value is 1 and the previous 0, or if the current value is 0 and the previous 1
es_es: La salida es 1 si el valor actual es 1 y el anterior 0, or si el valor actual es 0 y el anterior 1

source: In any other case the output is 0
es_es: En cualquier otro caso la salida es 0

source: When k=0, it works like a wire (The output is equal to the input) When k=1, it act as a not gate (The output is the inverse of the input)
es_es: Cuando k=0, funciona como un cable (La salida es igual a la entrada) Cuando k=1, actúa como una puerta NOT (salida es la inversa de la entrada)

source: ### Truth table for XOR | k | input | output | function | |---|-------|--------|----------| | 0 | 0 | 0 | wire | | 0 | 1 | 1 | wire | | 1 | 0 | 1 | Not | | 1 | 1 | 0 | Not |
es_es: ### Tabla de verdad para XOR | k | entrada | salida | función | |---|-------|--------|----------| | 0 | 0 | 0 | cable | | 0 | 1 | 1 | cable | | 1 | 0 | 1 | Not | | 1 | 1 | 0 | Not |

source: D Flip-flip (System)
es_es: Biestable D (Sistema)

source: Bus19-Split-3-8-8: Split the 19-bits bus into three buses of 3, 8 and 8 wires
es_es: Bus19-Split-3-8-8: Separar el bus de 19-bits en tres buses de 1, 8 y 8 cables

source: 4-to-1 Multplexer (8-bit channels)
es_es: Multiplexor 4-1 (Canales de 8 bits)

source: Counter-x02: 2-bits counter
es_es: Counter-x02: Contador de 2 bits

source: Generic component with clk input
es_es: Componente generico con entrada de clk

source: Inc1-2bit: Increment a 2-bits number by one
es_es: Inc1-2bit: Incrementar un número de 2 bits en uno

source: AdderK-2bit: Adder of 2-bit operand and 2-bit constant
es_es: AdderK-2bits: Sumador de un operando de 2 bits y una constante de 2 bits

source: Adder-2bits: Adder of two operands of 2 bits
es_es: Adder-2bits: Sumador de dos operandos de 2 bits

source: ## 19-bits constant: Manual testing
es_es: ## Constante de 19 bits: Prueba manual

source: 2-to-1 Multplexer (19-bit channels)
es_es: Multiplexor 2-1 (Canales de 19 bit)

source: Bus19-Join-3-8-8: Join the three buses into a 19-bits Bus
es_es: Bus19-Join-3-8-8: Agrupar tres buses en uno de 19 bits

source: ## 19-bits Value 0: Test on LEDs Show the values on the LEDs
es_es: ## Valor 0 de 19 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: ## Testing a 20-bits constant The value is shown in 8 LEDs. Initially only the less significant bits. When the button is pressed, the Upper bits are displayed
es_es: ## Probando una constante de 20-bits El valor se muestra en los 8 LEDs. Inicialmente sólo los bits menos significativos. Cuando se aprieta el botón, los bits superiores se muestran

source: Values for testing: 0-FFFFF
es_es: Valores para probar: 0-FFFFF

source: Display32-8: Display a 32-bits value on an 8-LEDs. The sel input selects the byte to display
es_es: Display32-8: Mostrar un valor de 32 birts en 8 LEDs. La entrada sel selecciona el byte a mostrar

source: Bus32-Split-quarter: Split the 32-bits bus into four buses of 8 wires
es_es: Bus32-Split-quarter: Separar el bus de 32-bits en cuatro buses del mismo tamaño

source: Bus32-Join-10-22: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-10-22: Agrupar dos buses en un bus de 32 bits

source: ## 22-bits constant: Manual testing
es_es: ###Constante de 22 bits: Prueba manual

source: Bus23-Split-7-8-8: Split the 23-bits bus into three buses of 7, 8 and 8 wires
es_es: Bus23-Split-7-8-8: Separar el bus de 23-bits en tres buses de 7, 8 y 8 cables

source: ## 23-bits constant: Manual testing
es_es: ###Constante de 23 bits: Prueba manual

source: 2-to-1 Multplexer (23-bit channels)
es_es: Multiplexor 2-1 (Canales de 23 bits)

source: Bus19-Split-3-8-8: Split the 19-bits bus into three buses of 3,8 and 8 bits
es_es: Bus19-Split-3-8-8: Separar el bus de 19-bits en tres buses de 1, 8 y 8 cables

source: Bus23-Join-7-8-8: Join the three buses into a 23-bits Bus
es_es: Bus23-Join-7-8-8: Agrupar los tres buses en uno de 23 bits

source: ## 23-bits Value 0: Test on LEDs Show the values on the LEDs
es_es: ## Valor 0 de 23 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: Bus24-Split-8-16: Split the 24-bits bus into two buses of 8 and 16 wires
es_es: Bus24-Split-8-16: Separar el bus de 24 bits en dos buses de 8 y 16 cables

source: ## Testing the 24-bits generic constant The 24-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 8 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## Probando una constante de 24-bits La constante de 24-bits se muestra en los 8 LEDs. Cuando el botón SW1 se pulsa, los 8 bits más significativos se muestran. El botón sw2 cambia entre los 8 bits menos significativos y los 8 de el medio

source: Values for testing: 0-FFFFFF
es_es: Valores para probar: 0-FFFFFF

source: ## Testing the 24-bits generic k-1 constant The 24-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 8 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## Probando una constante genérica k-1 de 24-bits La constante de 24-bits se muestra en los 8 LEDs. Cuando el botón SW1 se pulsa, los 8 bits más significativos se muestran. El botón sw2 cambia entre los 8 bits menos significativos y los 8 de el medio

source: Bus27-Split-3-8-8-8: Split the 27-bits bus into four buses of 7,8, 8 and 8 bits
es_es: Bus27-Split-3-8-8-8: Separar el bus de 27-bits en cuatro buses de 3, 8, 8 y 8 cables

source: ## 27-bits constant: Manual testing
es_es: ## Constante de 27-bits: Prueba manual

source: 2-to-1 Multplexer (27-bit channels)
es_es: Multiplexor 2-1 (Canales de 27 bits)

source: Bus27-Join-3-8-8-8: Join the four buses into a 27-bits Bus
es_es: Bus27-Join-3-8-8-8: Agrupar los cuatro buses en un bus de 17 bits

source: ## 27-bits Value 0: Test on LEDs Show the values on the LEDs
es_es: ## Valor 0 de 27 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: Bus28-Split-4-24: Split the 28-bits bus into two buses of 4 and 24 wires
es_es: Bus28-Split-4-24: Separar el bus de 28 bits en dos buses de 4 y 24 cables

source: ## 28-bits generic constant: Manual testing The 28-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 8 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## Constante genérica de 28 bits: Prueba manual La constante de 28 bits se muestra en los 8 LEDs. Cuando el botón SW1 se pulsa, los 8 bits más significativos se muestran. El botón sw2 cambia entre los 8 bits menos significativos y los 8 bits del medio

source: Values for testing: 0-FFFFFFF
es_es: Valores para probar: 0-FFFFFFF

source: ## 28-bits generic k-1 constant: Manual testing The 28-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 8 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## Constante genérica k-1 de 28 bits: Prueba manual La constante de 28 bits se muestra en los 8 LEDs. Cuando el botón SW1 se pulsa, los 8 bits más significativos se muestran. El botón sw2 cambia entre los 8 bits menos significativos y los 8 bits del medio

source: Bus32-Join-3-29: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-3-29: Agrupar dos buses en un bus de 32 bits

source: ## 29-bits generic constant: Manual testing The 29-bits constant is shown on the LEDs
es_es: # Constante genérica de 29 bits: Prueba manual La constante de 29-bits se muestra en los LEDs

source: Bus31-Split-7-8-8-8: Split the 31-bits bus into four buses of 7, 8, 8 and 8 wires
es_es: Bus31-Split-7-8-8-8: Separar el bus de 31-bits en cuatro buses de 7, 8, 8 y 8 cables

source: ## 31-bits constant: Manual testing
es_es: ## Constante de 31 bits: Prueba manual

source: 2-to-1 Multplexer (31-bit channels)
es_es: Multiplexor 2-1 (Canales de 31 bits)

source: Bus31-Split-7-8-8-8: Split the 31-bits bus into four buses of 7,8, 8 and 8 bits
es_es: Bus31-Split-7-8-8-8: Separar el bus de 31-bits en cuatro buses de 7, 8, 8 y 8 cables

source: Bus31-Join-7-8-8-8: Join the four buses into a 31-bits Bus
es_es: Bus31-Join-7-8-8-8: Agrupar los cuatro buses en un bus de 31 bits

source: ## 31-bits Value 0: Test on LEDs Show the values on the LEDs
es_es: ## Valor 0 de 31-bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: Bus32-Split-8-24: Split the 28-bits bus into two buses of 8 and 24 wires
es_es: Bus32-Split-8-24: Separar el bus de 28 bits en dos buses de 8 y 24 cables

source: ## 32 Bits constant: Manual testing The 32-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 8 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## Constante de 32 Bits: Prueba manual La constante de 32 bits se muestra en los 8 LEDs. Cuando el botón SW1 se pulsa, los 8 bits más significativos se muestran. El botón sw2 cambia entre los 8 bits menos significativos y los 8 bits del medio

source: Values for testing: 0-FFFFFFFF
es_es: Valores para probar: 0-FFFFFFFF

source: ## 32 Bits k-1 constant: Manual testing The 32-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 8 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## Constante de k-1 de 32 Bits: Prueba manual La constante de 32 bits se muestra en los 8 LEDs. Cuando el botón SW1 se pulsa, los 8 bits más significativos se muestran. El botón sw2 cambia entre los 8 bits menos significativos y los 8 bits del medio

source: ## Turn off an LED Output the 0-bit value. It will turn off the LED
es_es: ## Apagar un LED Sacar el valor 0. El LED se apagará

source: ## Turn on an LED Output the 1-bit value. It will turn on the LED
es_es: ## Encender un LED Sacar el bit 1. Se encenderá el LED

source: ## Changing the state of an LED Output the value given by the parameter. This value will turn on or off the LED
es_es: ## Cambiando el estado de un LED Sacar el valor indicado por el parámetro. Este valor encenderá o apagará el LED
