Repository: FPGAwars/iceK
Catalog: locale/*/*.po
Languages: es_es

source: ## Result The LED D1 is on (If you are connected to Internet you will see a picture) ![Alhambra II image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iceStick/Example-01-01-2.png)
es_es: ## Resultado: Se enciende el LED D1 (Si tienes conexión a internet verás una imagen) ![Alhambra II image](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iceStick/Example-01-01-2.png)

source: ## Result: The LEDs D1 and D2 are turned on (If you are connected to internet you will see a picture) ![iceStick board picture](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iceStick/Example-01-02-2.png)
es_es: ## Resultado: Se encienden los LED D1 y D2 (Si tienes conexión a internet verás una imagen) ![iceStick board picture](https://github.com/FPGAwars/iceK/raw/main/wiki/images/iceStick/Example-01-02-2.png)

source: ## Result The red LED is on (Boot) (If you are connected to Internet you will see a picture) ![TinyFPGA image](https://raw.githubusercontent.com/FPGAwars/iceK/main/wiki/images/TinyFPGA/Example-01-01-2.png)
es_es: ## Resultado: Se enciende el LED rojo (Boot) (Si tienes conexión a internet verás una imagen) ![TinyFPGA image](https://raw.githubusercontent.com/FPGAwars/iceK/main/wiki/images/TinyFPGA/Example-01-01-2.png)

source: # 1-bit Generic constant on one LED The value of the 1-bit generic constante is used for turning on or off the LED
es_es: # Constante genérica de 1 bit1 en un LEDs El valor de la constante genérica de 1-bit se usa para encender o apagar un LED

source: Set the value of the k constant (0 / 1)
es_es: Establecer el valor de la constante k (0 / 1)

source: 1-bit generic constant
es_es: Constante genérica de 1 bit

source: # 2-bit Generic constant on two LEDs The value of the 2-bit generic constante is used for turning on or off two LEDs
es_es: # Constante genérica de 2 bits en dos LEDs El valor de la constante genérica de 2-bits se usa para encender o apagar dos LEDs

source: Set the value of the k constant (0-3)
es_es: Establecer el valor the la constante k (0-3)

source: You can write the constants in binary
es_es: Puedes escribir las constantes en binary

source: # 4-bit Generic constant on four LEDs The value of the 4-bit generic constante is used for turning on or off two LEDs
es_es: # Constante genérica de 4 bits en cuatro LEDs El valor de genérico constante de 4 bits se usa para encender o apagar dos LEDs

source: Set the value of the k constant (0-15)
es_es: Establecer el valor de la constante k (0-15)

source: You can write the constants in binary
es_es: Puedes escribir las constantes en binario

source: ..Or in hexa
es_es: ..o en hexadecimal

source: 4-bit generic constant
es_es: Constante genérica de 4 bits

source: ## Changing the state of two LEDs Output the value given by the parameter. This value will turn on or off the LEDs
es_es: ## Cambiando el estado de dos LEDs Sacar el valor indicado por el parámetro. Este valor encenderá o apagará el LED

source: Values for testing: 0, 1, 2 and 3
es_es: Valores para probar: 0, 1, 2 y 3

source: 02-value-0
es_es: 02-valor-0

source: Generic: 2-bits generic constant (0/1)
es_es: Constante genérica de 2 bits (0-3)

source: ## 2-bits Value 0: Turning off two LEDs It will turn off the Two LEDs
es_es: ## Valor 0 de 2 bits: Apagando dos LEDs Se apagan dos LEDs

source: 03-value-1
es_es: 03-valor-1

source: ## 2-bits Value 1: Tests on LEDs It will turn on one LED
es_es: ## Valor 1 de 2 bits: Prueba en los LEDs Se enciende un LED

source: 04-value-2
es_es: 04-valor-3

source: ## 2-bits Value 2: Test on leds It will turn on one LED
es_es: ## Valor 2 de 2 bits: Prueba en los LEDs Se enciende un LED

source: ## 2-bits Value 3: Turning on two LEDs It will turn on the Two LEDs
es_es: ## Valor 3 de dos bits: Encendiendo dos LEDs Enciende los dos LEDs

source: Values for testing: 1, 2, 3 and 4
es_es: Valores para probar: 1, 2, 3 y 4

source: ## Changing the state of 3 LEDs Output the value given by the parameter. This value will turn on or off the LEDs
es_es: ## Cambiando el estado de 3 LEDs Sacar el valor indicado por el parámetro. Este valor encenderá o apagará los LEDs

source: Values for testing: 0-7
es_es: Valores para probar: 0-7

source: ## Changing the state of LEDs Output the value given by the parameter. This value will turn on or off the LEDs
es_es: ## Cambiando el estado de los LEDs Sacar el valor indicado por el parámetro. Este valor encenderá o apagará los LEDs

source: Values for testing: 1, 2, ..., 8
es_es: Valores para probar: 1, 2, ..., 8

source: ## 3-bits Value 0: Test on LEDs It will turn off the Three LEDs
es_es: ## Valor 0 de 3 bits: Prueba en los LEDs Se apagan los tres LEDs

source: ## 3-bits Value 1: Test on LEDs Show the value on the LEDs
es_es: ## Valor 1 de 3 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: ## 3-bits Value 2: Test on LEDs Show the value on the LEDs
es_es: ## Valor 2 de 3 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: ## 3-bits Value 4: Test on LEDs Show the value on the LEDs
es_es: ## Valor 4 de 3 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: ## 3-bits Value 7: Turning on three LEDs It will turn on the Three LEDs
es_es: ## Valor 7 de 3 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: ## Changing the state of 4 LEDs Output the value given by the parameter. This value will turn on or off the LEDs
es_es: ## Cambiando el estado de 4 LEDs Sacar el valor indicado por el parámetro. Este valor encenderá o apagará los LEDs

source: Values for testing: 0-15
es_es: Valores para probar: 0-15

source: ## 4-bits Value 0: Test on LEDs Show the values on the LEDs
es_es: ## Valor 0 de 4 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: ## 4-bits Value 15: Test on LEDs Show the values on the LEDs
es_es: ## Valor 15 de 4 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: ## 4-bits Value 1: Test on LEDs Show the values on the LEDs
es_es: ## Valor 1 de 4 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: ## 4-bits Value 2: Test on LEDs Show the values on the LEDs
es_es: ## Valor 2 de 4 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: ## 4-bits Value 4: Test on LEDs Show the values on the LEDs
es_es: ## Valor 4 de 4 bits: Prueba en LEDs Mostrar el valor en los LEDs

source: ## 4-bits Value 8: Test on LEDs Show the values on the LEDs
es_es: ## Valor 8 de 4 bits: Prueba en LEDs Mostrar el valor en los LEDs

source: value-F
es_es: valor-F

source: 4bits constant value: 15
es_es: Valor constante 15 de 4 bits

source: ## Changing the state of 5 LEDs Output the value given by the parameter. This value will turn on or off the LEDs
es_es: ## Cambiando el estado de 5 LEDs Sacar el valor indicado por el parámetro. Este valor encenderá o apagará los LEDs

source: Values for testing: 0-31
es_es: Valores para probar: 0-31

source: Values for testing: 1, 2, ..., 32
es_es: Valores para probar: 1, 2, ..., 32

source: ## 5-bits Value 0: Test on LEDs Show the values on the LEDs
es_es: ## Valor 0 de 5 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: ## Changing the state of 6 LEDs Output the value given by the parameter. This value will turn on or off the LEDs
es_es: ## Cambiando el estado de 6 LEDs Sacar el valor indicado por el parámetro. Este valor encenderá o apagará los LEDs

source: Values for testing: 0-63
es_es: Valores para probar: 0-63

source: Values for testing: 1, 2, ..., 64
es_es: Valores para probar: 1, 2, ..., 64

source: ## 6-bits Value 0: Test on LEDs Show the values on the LEDs
es_es: ## Valor 0 de 6 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: ## Changing the state of 7 LEDs Output the value given by the parameter. This value will turn on or off the LEDs
es_es: ## Cambiando el estado de 7 LEDs Sacar el valor indicado por el parámetro. Este valor encenderá o apagará los LEDs

source: Values for testing: 0-127
es_es: Valores para probar: 0-127

source: Values for testing: 1, 2, ..., 128
es_es: Valores para probar: 1, 2, ..., 128

source: ## 7-bits Value 0: Test on LEDs Show the values on the LEDs
es_es: ## Valor 0 de 7 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: ## Changing the state of 8 LEDs Output the value given by the parameter. This value will turn on or off the LEDs
es_es: ## Cambiando el estado de 8 LEDs Sacar el valor indicado por el parámetro. Este valor encenderá o apagará los LEDs

source: Values for testing: 0-255
es_es: Valores para probar: 0-255

source: Values for testing: 1, 2, ..., 256
es_es: Valores para probar: 1, 2, ..., 256

source: ## 8-bits Value 0: Test on LEDs Show the values on the LEDs
es_es: ## Valor 0 de 8 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: 2-to-1 Multplexer (8-bit channels)
es_es: Multiplexor 2-1 (Canales de 8 bits)

source: 2-to-1 Multplexer (4-bit channels)
es_es: Multiplexor 2-1 (Canales de 4 bits)

source: 2-to-1 Multplexer (1-bit channels)
es_es: Multiplexor 2-1 (Canales de 1 bit)

source: OR2: Two bits input OR gate
es_es: OR2: Puerta OR de dos entradas de un bit

source: Two bits input And gate
es_es: Puerta AND de dos bits de entrada

source: NOT gate (Verilog implementation)
es_es: Puerta NOT (implementación en Verilog)

source: Bus4-Join-all: Join all the wires into a 4-bits Bus
es_es: Bus4-Join-all: Agrupar todos los cables en un bus de 4 bits

source: Bus4-Split-all: Split the 4-bits bus into its wires
es_es: Bus4-Split-all: Separar el bus de 4 bits en cuatro cables

source: Bus8-Join-half: Join the two same halves into an 8-bits Bus
es_es: Bus8-Join-half: Agrupar los dos mitades en un bus de 8 bits

source: Bus8-Split-half: Split the 8-bits bus into two buses of the same size
es_es: Bus8-Split-half: Separar el bus de 8 bits en dos buses del mismo tamaño

source: Bus7-Join-7-1: Join the two buses into an 8-bits Bus
es_es: Bus7-Join-7-1: Agrupar dos buses en un bus de 8 bits

source: ## 9-bits constant: Manual testing
es_es: ## Constante de 9 bits: Prueba manual

source: Channel B
es_es: Canal B

source: Channel A
es_es: Canal A

source: Input
es_es: Entrada

source: Output
es_es: Salida

source: 2-to-1 Multplexer (9-bit channels)
es_es: Multiplexor 2-1 (Canales de 9 bits)

source: Bus8-Join-1-8: Join the two buses into an 9-bits Bus
es_es: Bus8-Join-1-8: Agrupar dos buses en un bus de 9 bits

source: UINT8-1bit: Extend a 1-bit unsigned integer to 8-bits
es_es: UINT8-1bit: Extender un entero de 1 bit a 8 bits

source: ## 9-bits Value 0: Test on LEDs Show the values on the LEDs
es_es: ## Valor 0 de 9 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: Bus10-Split-half: Split the 10-bits bus into two buses of 2 and 8 wires
es_es: Bus10-Split-half: Separar el bus de 10-bits en dos mitades iguales (de 5 bits)

source: Bus8-Join-6-2: Join the two buses into an 8-bits Bus
es_es: Bus8-Join-6-2: Agrupar dos buses en un bus de 8 bits

source: ## 10-bits constant: Manual testing
es_es: ### Constantes de 10 bits: Prueba manual

source: 2-to-1 Multplexer (10-bit channels)
es_es: Multiplexor 2-1 (Canales de 10 bits)

source: Bus10-Split-2-8: Split the 10-bits bus into two buses of 2 and 8 wires
es_es: Bus10-Split-2-8: Separar el bus de 10 bits en dos buses de 2 y 8 cables

source: 2-to-1 Multplexer (2-bit channels)
es_es: Multiplexor 2-1 (Canales de 2 bit)

source: Bus2-Join-all: Joint two wires into a 2-bits Bus
es_es: Bus2-Join-all: Agrupar dos cables en un bus de 2 bits

source: Bus2-Split-all: Split the 2-bits bus into two wires
es_es: Bus2-Split-all: Separar el bus de 2 bits en dos cables

source: Bus10-Join-2-8: Join the two buses into an 10-bits Bus
es_es: Bus10-Join-2-8: Juntar los dos buses en un bus de 10-bits

source: UINT8-2bits: Extend a 2-bits unsigned integer to 8-bits
es_es: UINT8-2bit: Extender un entero de 2 bits a 8 bits

source: ## 10-bits Value 0: Test on LEDs Show the values on the LEDs
es_es: ## Valor 0 de 10 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: Bus11-Split-3-8: Split the 11-bits bus into two buses of 3 and 8 wires
es_es: Bus11-Split-3-8: Separar el bus de 11-bits en dos buses de 3 y 8 cables

source: Bus8-Join-5-3: Join the two buses into an 8-bits Bus
es_es: Bus8-Join-5-3: Agrupar dos buses en un bus de 8 bits

source: ## Testing a 11-bits constant The value is shown in 8 LEDs
es_es: ## Probando una constante de 11-bits El valor se muestra en los 8 LEDs

source: 2-to-1 Multplexer (11-bit channels)
es_es: Multiplexor 2-1 (Canales de 11 bit)

source: 2-to-1 Multplexer (3-bit channels)
es_es: Multiplexor 2-1 (Canales de 3 bits)

source: Bus3-Join-all: Joint three wires into a 3-bits Bus
es_es: Bus3-Join-all: Agrupar tres cables en un bus de 3 bits

source: Bus3-Split-all: Split the 3-bits bus into three wires
es_es: Bus3-Split-all: Separar el bus de 3 bits en tres cables

source: Bus11-Join-3-8: Join the two buses into an 11-bits Bus
es_es: Bus11-Join-3-8: Juntar los dos buses en un bus de 11-bits

source: UINT8-3bits: Extend a 3-bits unsigned integer to 8-bits
es_es: UINT8-3bit: Extender un entero de 3 bit a 8 bits

source: ## 11-bits Value 0: Test on LEDs Show the values on the LEDs
es_es: ## Valor 0 de 11 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: Bus12-Split-4-8: Split the 12-bits bus into two buses of 4 and 8 wires
es_es: Bus12-Split-4-8: Separar el bus de 12 bits en dos buses de 4 y 8 cables

source: ## Testing a 12-bits constant The value is shown in 8 LEDs. Initially only the less significant bits. When the button is pressed, the Upper bits are displayed
es_es: ## Probando una constante de 12-bits El valor se muestra en los 8 LEDs. Inicialmente sólo los bits menos significativos. Cuando se aprieta el botón, los bits superiores se muestran

source: Values for testing: 0-4096
es_es: Valores para probar: 0-4096

source: Bus15-Split-7-8: Split the 15-bits bus into two buses of 7 and 8 wires
es_es: Bus15-Split-7-8: Separar el bus de 15 bits en dos buses de 7 y 8 cables

source: Bus7-Join-1-7: Join the two buses into an 8-bits Bus
es_es: Bus7-Join-1-7: Agrupar dos buses en un bus de 8 bits

source: ## 15-bits constant: Manual testing
es_es: ## Constante de 15 bits: Prueba manual

source: 2-to-1 Multplexer (15-bit channels)
es_es: Multiplexor 2-1 (Canales de 15 bit)

source: Bus15-Split-7-8: Split the 15-bits bus into two buses of 7 and 8 bits
es_es: Bus15-Split-7-8: Separar el bus de 15 bits en dos buses de 7 y 8 cables

source: 2-to-1 Multplexer (7-bit channels)
es_es: Multiplexor 2-1 (Canales de 7 bits)

source: Bus7-Join-3-4: Join the two buses into a 7-bits Bus
es_es: Bus7-Join-3-4: Agrupar dos buses en un bus de 7 bits

source: Bus7-Split-3-4: Split the 7-bits bus into two buses of 3 and 4 wires
es_es: Bus7-Split-3-4: Separar el bus de 7 bits en dos buses de 3 y 4 cables

source: Bus15-Join-7-8: Join the two buses into a 15-bits Bus
es_es: Bus15-Join-7-8: Agrupar dos buses en un bus de 15 bits

source: UINT8-7bits: Extend a 7-bits unsigned integer to 8-bits
es_es: UINT8-7bit: Extender un entero de 7 bit a 8 bits

source: ## 15-bits Value 0: Test on LEDs Show the values on the LEDs
es_es: ## Valor 0 de 15 bits: Prueba en los LEDs Mostrar el valor en los LEDs

source: Bus16-Split-half: Split the 16-bits bus into two buses of the same size
es_es: Bus16-Split-half: Separar el bus de 16 bits en dos buses del mismo tamaño

source: ## Testing a 16-bits constant The value is shown in 8 LEDs. Initially only the less significant bits. When the button is pressed, the Upper bits are displayed
es_es: ## Probando una constante de 16-bits El valor se muestra en los 8 LEDs. Inicialmente sólo los bits menos significativos. Cuando se aprieta el botón, los bits superiores se muestran

source: Values for testing: 0-FFFF
es_es: Valores para probar: 0-FFFF

source: Button-tic: Configurable button that emits a tic when it is pressed
es_es: Button-tic: Botón configurable que emite un tic cuando se pulsa

source: Rising-edge detector. It generates a 1-period pulse (tic) when a rising edge is detected on the input
es_es: Detector de flanco de subida. Se genera un pulso de un ciclo cuando se detecta un flanco de subida en la entrada

source: D Flip-flop (verilog implementation)
es_es: Biestable D (Implementación en verilog)

source: Configurable button (pull-up on/off. Not on/off)
es_es: Botón configurable (pull-up on/off. Not on/off)

source: FPGA internal pull-up configuration on the input port
es_es: Configuración del pull-up interno de la FPGA en el puerto de entrada

source: Remove the rebound on a mechanical switch
es_es: Eliminar los rebotes de un interruptor mecánico

source: 1bit register (implemented in verilog)
es_es: Registro de 1 bit (implementado en verilog)

source: 16-bits Syscounter with reset
es_es: Contador del sistema de 16 bits con reset

source: DFF-rst-x16: 16 D flip-flops in paralell with reset
es_es: DFF-rst-x16: 16 biestables D en paralelo, con reset

source: DFF-rst-x04: Three D flip-flops in paralell with reset
es_es: DFF-rst-x04: Cuatro biestables D en paralelo, con reset

source: DFF-rst-x01: D Flip flop with reset input. When rst=1, the DFF is 0
es_es: DFF-rst-x01: Biestable D con entrada de reset. Cuando rst=1, el biestable es 0

source: Bus16-Split-quarter: Split the 16-bits bus into four buses of the same size
es_es: Bus16-Split-quarter: Separar el bus de 16-bits en cuatro buses del mismo tamaño

source: Bus16-Join-quarter: Join the four same buses into an 16-bits Bus
es_es: Bus16-Join-quarter: Agrupar cuatro buses iguales en uno de 16 bits

source: Inc1-16bit: Increment a 16-bits number by one
es_es: Inc1-16bit: Incrementar un número de 16 bits en uno

source: AdderK-16bit: Adder of 16-bit operand and 16-bit constant
es_es: AdderK-16bits: Sumador de un operando de 16 bits y una constante de 16 bits

source: Adder-16bits: Adder of two operands of 16 bits
es_es: Adder-16bits: Sumador de dos operandos de 16 bits

source: Adder-8bits: Adder of two operands of 8 bits
es_es: Adder-8bits: Sumador de dos operandos de 8 bits

source: Adder-4bits: Adder of two operands of 4 bits
es_es: Adder-4bits: Sumador de dos operandos de 4bits

source: Adder-1bit: Adder of two operands of 1 bit
es_es: Adder-1bits: Sumador de dos operandos de 1 bit

source: AdderC-1bit: Adder of two operands of 1 bit plus the carry in
es_es: AdderC-1bits: Sumador de dos operandos de 1 bit más el bit de acarreo

source: XOR gate: two bits input xor gate
es_es: XOR gate: Puerta XOR de dos bits de entrada

source: AdderC-4bits: Adder of two operands of 4 bits and Carry in
es_es: AdderC-4bits: Sumador de dos operandos de 4 bits más el bit de acarreo

source: AdderC-8bits: Adder of two operands of 8 bits and Carry in
es_es: AdderC-8bits: Sumador de dos operandos de 8 bits más el bit de acarreo

source: Bus16-Join-half: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-half: Agrupar dos buses iguales en uno de 16 bits

source: Edges detector. It generates a 1-period pulse (tic) when either a rising edge or a falling edge is detected on the input
es_es: Detector de flancos. Se genera un pulso de un ciclo de anchura cuando se detecta un flanco de subida o de bajada en la entrada

source: Sync 1-bit input with the system clock domain
es_es: Sincronizar una entrada de 1 bit con el dominio del reloj del sistema

source: Select positive or negative logic for the input (0=positive, 1=negative)
es_es: Seleccionar lógica positiva o negativa para la entrada (0=positiva, 1=negativa)

source: Display16-8: Display a 16-bits value on an 8-LEDs. The sel input selects the byte to display
es_es: Display16-8: Mostrar un valor de 16 birts en 8 LEDs. La entrada sel selecciona el byte a mostrar

source: Counter-x01: 1-bit counter
es_es: Counter-x01: Contador de 1 bit

source: Reg: 1-Bit register
es_es: Reg: Registro de 1-Bit

source: 2-to-1 Multplexer (1-bit channels). Fippled version
es_es: Multiplexor 2-1 (canales de 1 bit). Versión girada

source: Bus20-Split-4-16: Split the 20-bits bus into two buses of 4 and 16 wires
es_es: Bus20-Split-4-16: Separar el bus de 20 bits en dos buses de 4 y 16 cables

source: ## 17-bits constant: Manual testing
es_es: ### Constantes de 17 bits: Prueba manual

source: System clock
es_es: Reloj del sistema

source: Button state signal
es_es: Señal de estado del botón

source: Tic: button pressed
es_es: Tic: button apretado

source: Rising edge detector
es_es: Detector de flanco de subida

source: Not on/off
es_es: NOT activada/desactivada

source: ## Rising edge detector It generates a 1-period pulse (tic) when a rising edge is detected on the input signal
es_es: ### Detector de flancos de subida Se genera un pulso de un ciclo de reloj de anchura cuando se detecta un flanco de subida en la señal de entrada

source: Input signal
es_es: Señal de entrada

source: Current signal state
es_es: Estado actual de la señal

source: Signal state in the previous clock cycle
es_es: Señal de estado en el ciclo de reloj anterior

source: If the current signal is 1 and its value in the previous clock cycle was 0, it means that a rising edge has been detected! The output es 1 In any other case the output is 0
es_es: Si la señal actual es 1 y su valor en el ciclo anterior era 0, significa que se ha detectado un flanco de subida! La salida es 1 En cualquier otro caso la salida es 0

source: **Delay**: 0 clock cycles There is no delay between the arrival of a rising edge and its detection
es_es: **Retardo**: 0 ciclos de reloj No hay retardo entre la llegada de un flanco de subida y su detección

source: Parameter: Initial value
es_es: Parámetro: Valor inicial

source: Input data
es_es: Datos de entrada

source: # D Flip-Flop It stores the input data that arrives at cycle n Its output is shown in the cycle n+1
es_es: # Biestable D Almacena el dato de entrada que llega en el ciclo n Su salida se muestra en el ciclo n+1

source: Internal pull-up * 0: OFF * 1: ON
es_es: Pull-up interno * 0: Apagado * 1: activado

source: Synchronization stage
es_es: Etapa de sincronización

source: Normalization stage * 0: Wire * 1: signal inverted
es_es: Etapa de normalización * 0: Cable * 1: Señal invertida

source: Debouncing stage
es_es: Etapa antirrebotes

source: ### Pull-up parameter: 0: No pull-up 1: Pull-up activated
es_es: ### Parámetro pull-up: 0: Sin pull-up 1: Pull-up activado

source: Only an FPGA pin can be connected here!!!
es_es: Sólo se puede conectar aquí un pin de la FPGA!!!

source: The pull-up is connected by default
es_es: El pull-up se activa por defecto

source: Edge detector
es_es: Detector de flancos

source: Whenever there is a change in the input, the counter is started
es_es: Siempre que haya un cambio en la entrada, el contador arranca

source: If the counter reaches it maximum value, the input is considered stable and it is captured
es_es: Si el contador alcanza el valor máximo la entrada se considera estable y se captura

source: ### Time calculation For CLK=12MHZ, a 16-bit counter reaches its maximum every 2 ** 16 * 1/F = 5.5ms aprox IF more time is needed for debouncing, use a counter with more bits (17, 18...)
es_es: ### Cálculo de tiempo Para CLK=12MHZ, un contador de 16 bits alcanza su valor máximo cada 2**16*1/F=5.5ms aprox Si se requiere mayor tiempo para el antirrebores, usa un contador con más bits (17, 18...)

source: ## Debouncer A value is considered stable when there is no changes during 5.5ms aprox. When a value is stable it is captured on the output flip-flop
es_es: ## Antirrebotes Un valor se considera estable cuando no hay cambios durante 5.5ms aprox. Cuando un valor es estable, se captura en el biestable de salida

source: Stable output
es_es: Salida estable

source: Counter
es_es: Contador

source: Initial value
es_es: Valor inicial

source: Reset input: Active high When rst = 1, the DFF is reset to 0
es_es: Entrada de reset: Activa a nivel alto Cuando rst=1, el DFF se pone a 0

source: Data input
es_es: Entrada de datos
